#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-northeast-2"
      + tags     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "igw-an2-airline-network-main"
          + "Project"     = "airline"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "igw-an2-airline-network-main"
          + "Project"     = "airline"
          + "Team"        = "Indiana Zones"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.regional will be created
  + resource "aws_nat_gateway" "regional" {
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = "regional"
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "ap-northeast-2"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nat-an2-airline-network-regional"
          + "Project"     = "airline"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nat-an2-airline-network-regional"
          + "Project"     = "airline"
          + "Team"        = "Indiana Zones"
        }
      + vpc_id                             = (known after apply)
    }

  # module.vpc.aws_route_table.db_private will be created
  + resource "aws_route_table" "db_private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-db-pri"
          + "Project"     = "airline"
          + "Role"        = "db"
          + "Tier"        = "private"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-db-pri"
          + "Project"     = "airline"
          + "Role"        = "db"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.pod_private will be created
  + resource "aws_route_table" "pod_private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-pod-pri"
          + "Project"     = "airline"
          + "Role"        = "pod"
          + "Tier"        = "private"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-pod-pri"
          + "Project"     = "airline"
          + "Role"        = "pod"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-shared-pri"
          + "Project"     = "airline"
          + "Role"        = "node"
          + "Tier"        = "private"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-shared-pri"
          + "Project"     = "airline"
          + "Role"        = "node"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-edge-pub"
          + "Project"     = "airline"
          + "Tier"        = "public"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rt-an2-airline-edge-pub"
          + "Project"     = "airline"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.pod["pod_private_2a"] will be created
  + resource "aws_route_table_association" "pod" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.pod["pod_private_2c"] will be created
  + resource "aws_route_table_association" "pod" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.primary["db_private_2a"] will be created
  + resource "aws_route_table_association" "primary" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.primary["db_private_2c"] will be created
  + resource "aws_route_table_association" "primary" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.primary["edge_public_2a"] will be created
  + resource "aws_route_table_association" "primary" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.primary["edge_public_2c"] will be created
  + resource "aws_route_table_association" "primary" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.primary["node_private_2a"] will be created
  + resource "aws_route_table_association" "primary" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.primary["node_private_2c"] will be created
  + resource "aws_route_table_association" "primary" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.pod["pod_private_2a"] will be created
  + resource "aws_subnet" "pod" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-pod-pri-2a"
          + "Project"     = "airline"
          + "Role"        = "pod"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-pod-pri-2a"
          + "Project"     = "airline"
          + "Role"        = "pod"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.pod["pod_private_2c"] will be created
  + resource "aws_subnet" "pod" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-pod-pri-2c"
          + "Project"     = "airline"
          + "Role"        = "pod"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-pod-pri-2c"
          + "Project"     = "airline"
          + "Role"        = "pod"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.primary["db_private_2a"] will be created
  + resource "aws_subnet" "primary" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.192/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-db-pri-2a"
          + "Project"     = "airline"
          + "Role"        = "db"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-db-pri-2a"
          + "Project"     = "airline"
          + "Role"        = "db"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.primary["db_private_2c"] will be created
  + resource "aws_subnet" "primary" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.208/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-db-pri-2c"
          + "Project"     = "airline"
          + "Role"        = "db"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "subnet-an2-airline-db-pri-2c"
          + "Project"     = "airline"
          + "Role"        = "db"
          + "Team"        = "Indiana Zones"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.primary["edge_public_2a"] will be created
  + resource "aws_subnet" "primary" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-edge-pub-2a"
          + "Project"                                    = "airline"
          + "Role"                                       = "edge"
          + "Tier"                                       = "public"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + tags_all                                       = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-edge-pub-2a"
          + "Project"                                    = "airline"
          + "Role"                                       = "edge"
          + "Team"                                       = "Indiana Zones"
          + "Tier"                                       = "public"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.primary["edge_public_2c"] will be created
  + resource "aws_subnet" "primary" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-edge-pub-2c"
          + "Project"                                    = "airline"
          + "Role"                                       = "edge"
          + "Tier"                                       = "public"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + tags_all                                       = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-edge-pub-2c"
          + "Project"                                    = "airline"
          + "Role"                                       = "edge"
          + "Team"                                       = "Indiana Zones"
          + "Tier"                                       = "public"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.primary["node_private_2a"] will be created
  + resource "aws_subnet" "primary" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-node-pri-2a"
          + "Project"                                    = "airline"
          + "Role"                                       = "node"
          + "Tier"                                       = "private"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + tags_all                                       = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-node-pri-2a"
          + "Project"                                    = "airline"
          + "Role"                                       = "node"
          + "Team"                                       = "Indiana Zones"
          + "Tier"                                       = "private"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.primary["node_private_2c"] will be created
  + resource "aws_subnet" "primary" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.128/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-node-pri-2c"
          + "Project"                                    = "airline"
          + "Role"                                       = "node"
          + "Tier"                                       = "private"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + tags_all                                       = {
          + "Environment"                                = "prod"
          + "ManagedBy"                                  = "terraform"
          + "Name"                                       = "subnet-an2-airline-node-pri-2c"
          + "Project"                                    = "airline"
          + "Role"                                       = "node"
          + "Team"                                       = "Indiana Zones"
          + "Tier"                                       = "private"
          + "kubernetes.io/cluster/eks-an2-airline-main" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-northeast-2"
      + tags                                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-an2-airline-network-main"
          + "Project"     = "airline"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-an2-airline-network-main"
          + "Project"     = "airline"
          + "Team"        = "Indiana Zones"
        }
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.pod will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "pod" {
      + cidr_block = "100.64.0.0/23"
      + id         = (known after apply)
      + region     = "ap-northeast-2"
      + vpc_id     = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_private_subnet_ids    = {
      + db_private_2a = (known after apply)
      + db_private_2c = (known after apply)
    }
  + ecr_repository_names     = []
  + ecr_repository_urls      = {}
  + nat_gateway_id           = (known after apply)
  + node_private_subnet_ids  = {
      + node_private_2a = (known after apply)
      + node_private_2c = (known after apply)
    }
  + pod_private_subnet_ids   = {
      + pod_private_2a = (known after apply)
      + pod_private_2c = (known after apply)
    }
  + private_subnet_ids       = {
      + db_private_2a   = (known after apply)
      + db_private_2c   = (known after apply)
      + node_private_2a = (known after apply)
      + node_private_2c = (known after apply)
      + pod_private_2a  = (known after apply)
      + pod_private_2c  = (known after apply)
    }
  + public_subnet_ids        = {
      + edge_public_2a = (known after apply)
      + edge_public_2c = (known after apply)
    }
  + route_table_ids          = {
      + db_private  = (known after apply)
      + pod_private = (known after apply)
      + private     = (known after apply)
      + public      = (known after apply)
    }
  + vpc_id                   = (known after apply)
  + vpc_secondary_cidr_block = "100.64.0.0/23"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kwonjh0406, Action: `pull_request`*